<a href="https://colab.research.google.com/github/Rachanashenoy20/Machine-Learning/blob/main/Data_cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

# Load the Titanic dataset
df = pd.read_csv('/content/c (1).csv')

# Identify and count duplicate rows
duplicates = df.duplicated()
print("Number of duplicate rows:", duplicates.sum())
# Identify columns with only one unique value
single_value_cols = []
for col in df.columns:
    if df[col].nunique() == 1:
        single_value_cols.append(col)
print("Columns with only one unique value:", single_value_cols)
# Delete columns with only one unique value
df.drop(single_value_cols, axis=1, inplace=True)
print("New dataset after deleting columns with only one unique value:")
print(df.head())
print("rachanashenoy")
print("4SF20CI048")

Number of duplicate rows: 2
Columns with only one unique value: []
New dataset after deleting columns with only one unique value:
      Name  Age           City  Salary
0     John   25       New York   50000
1    Sarah   30    Los Angeles   60000
2    Sarah   30    Los Angeles   60000
3    Sarah   35        Chicago   65000
4  Michael   40  San Francisco   70000
rachanashenoy
4SF20CI048

In [6]:
import pandas as pd

df = pd.read_csv('/content/c (1).csv')

new_df = df.dropna()

print(new_df.to_string())
print("rachanashenoy")
print("4SF20CI048")

      Name  Age           City  Salary
0     John   25       New York   50000
1    Sarah   30    Los Angeles   60000
2    Sarah   30    Los Angeles   60000
3    Sarah   35        Chicago   65000
4  Michael   40  San Francisco   70000
5     John   30       New York   60000
6    Sarah   30    Los Angeles   60000
rachanashenoy
4SF20CI048

In [7]:
import pandas as pd

df = pd.read_csv('/content/c (1).csv')

new_df = df.dropna()

print(df.duplicated())
print("rachanashenoy")
print("4SF20CI048")

0    False
1    False
2     True
3    False
4    False
5    False
6     True
dtype: bool
rachanashenoy
4SF20CI048